Revit 2027 API
IFCData.CreateDouble Method
 Creates a double data object.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCData CreateDouble(
	double value
)
Public Shared Function CreateDouble (
	value As Double
) As IFCData
public:
static IFCData^ CreateDouble(
	double value
)
static member CreateDouble :
        value : float -> IFCData
Parameters
value Double
 The double value.
Return Value
IFCData
 The IFCData object.
See Also
Reference
IFCData Class
Autodesk.Revit.DB.IFC Namespace